#include <Camera.h>

//==================================================================================================
// Библиотеки
//==================================================================================================

#define DEBUG true


// Объект камеры
Camera cam_l;
Camera cam_r;

// Таймер считывания камеры
unsigned long timer_cam = 0;

//==================================================================================================
// Инициализация
//==================================================================================================

void setup() {
  camSetup();
  Serial.begin(115200);
}

//==================================================================================================
// Главный цикл
//==================================================================================================

void loop() {
  if (millis() - timer_cam >= 10) {
    camRead();
    //debugCameraL();
    Serial.println("Defined Cell: " + String(camDefineCell(camLineBlobFilter(&cam_l))));
    //debugCameraR();
    
    timer_cam = millis();
  }
}
